### Documento para analizar el comportamiento del dato nulo en 'Customer_ID' del dataset

In [1]:
import pandas as pd
import numpy as np

In [2]:
# Update the file path to the correct location
df = pd.read_csv('online_retail.csv')

In [3]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

In [5]:
# estandarizar el formato de la columna 'InvoiceDate'
df['InvoiceDate'] = pd.to_datetime(df['InvoiceDate'])

In [6]:
# Estandarizar el formato de la columna 'CustomerID' a int
df['CustomerID'] = df['CustomerID'].astype('Int64')

In [7]:
# Crear un dataframe con los valores nulos de 'CustomerID'
df_nulls = df[df['CustomerID'].isnull()]

In [8]:
df_nulls.shape
print(f'El numero de columnas con valores nulos en CustomerID es: {df_nulls.shape[0]}')

El numero de columnas con valores nulos en CustomerID es: 135080

In [9]:
# Cuantas veces sale cada pais en df_nulls
df_nulls['Country'].value_counts()

Country
United Kingdom    133600
EIRE                 711
Hong Kong            288
Unspecified          202
Switzerland          125
France                66
Israel                47
Portugal              39
Bahrain                2
Name: count, dtype: int64

In [10]:
#Cuentame los tipos de datos de las columnas descripcion.
df['Description'].value_counts()

Description
WHITE HANGING HEART T-LIGHT HOLDER     2369
REGENCY CAKESTAND 3 TIER               2200
JUMBO BAG RED RETROSPOT                2159
PARTY BUNTING                          1727
LUNCH BAG RED RETROSPOT                1638
                                       ...
Missing                                   1
historic computer difference?....se       1
DUSTY PINK CHRISTMAS TREE 30CM            1
WRAP BLUE RUSSIAN FOLKART                 1
PINK BERTIE MOBILE PHONE CHARM            1
Name: count, Length: 4223, dtype: int64

In [11]:
df_nulls.head(10)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
622,536414,22139,NaN,56,2010-12-01 11:52:00,0.00,<NA>,United Kingdom
1443,536544,21773,DECORATIVE ROSE BATHROOM BOTTLE,1,2010-12-01 14:32:00,2.51,<NA>,United Kingdom
1444,536544,21774,DECORATIVE CATS BATHROOM BOTTLE,2,2010-12-01 14:32:00,2.51,<NA>,United Kingdom
1445,536544,21786,POLKADOT RAIN HAT,4,2010-12-01 14:32:00,0.85,<NA>,United Kingdom
1446,536544,21787,RAIN PONCHO RETROSPOT,2,2010-12-01 14:32:00,1.66,<NA>,United Kingdom
1447,536544,21790,VINTAGE SNAP CARDS,9,2010-12-01 14:32:00,1.66,<NA>,United Kingdom
1448,536544,21791,VINTAGE HEADS AND TAILS CARD GAME,2,2010-12-01 14:32:00,2.51,<NA>,United Kingdom
1449,536544,21801,CHRISTMAS TREE DECORATION WITH BELL,10,2010-12-01 14:32:00,0.43,<NA>,United Kingdom
1450,536544,21802,CHRISTMAS TREE HEART DECORATION,9,2010-12-01 14:32:00,0.43,<NA>,United Kingdom
1451,536544,21803,CHRISTMAS TREE STAR DECORATION,11,2010-12-01 14:32:00,0.43,<NA>,United Kingdom

In [12]:
#Cuantas veces sale cada InoviceNo en df_nulls
df_nulls['InvoiceNo'].value_counts()

InvoiceNo
573585    1114
581219     749
581492     731
580729     721
558475     705
          ...
551460       1
551461       1
551506       1
551538       1
556122       1
Name: count, Length: 3710, dtype: int64

In [13]:
#Dime cuales son los valores cuyo quantity es negativo
df_negatives = df[df['Quantity'] < 0]
df_negatives.shape
print(f'El numero de filas con valores negativos en Quantity es: {df_negatives.shape[0]}')

El numero de filas con valores negativos en Quantity es: 10624

In [14]:
#Cuales y cuantos tipos de descripcion hay en df_nulls
df_nulls['Description'].value_counts()

Description
DOTCOM POSTAGE                       693
JUMBO BAG RED RETROSPOT              497
JUMBO STORAGE BAG SUKI               414
JUMBO SHOPPER VINTAGE RED PAISLEY    388
JUMBO BAG WOODLAND ANIMALS           372
                                    ...
EAU DE NILE JEWELLED PHOTOFRAME        1
WHITE VINTAGE CRYSTAL BRACELET         1
RUBY GLASS NECKLACE 42"                1
PURPLE LAS VEGAS BRACELET ROUND        1
BLUE LEAVES AND BEADS PHONE CHARM      1
Name: count, Length: 3554, dtype: int64

In [15]:
#dime cuantos stockcode hay en df_nulls
df_nulls['StockCode'].value_counts()

StockCode
DOT       694
85099B    497
21931     414
22411     388
20712     372
         ...
85195       1
47574B      1
16053       1
16244B      1
84859B      1
Name: count, Length: 3810, dtype: int64

In [16]:
#Muestrame los datos cuya descripcion sea 'DOTCOM POSTAGE' en el df_nulls
df_nulls[df_nulls['Description'] == 'DOTCOM POSTAGE']

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
1814,536544,DOT,DOTCOM POSTAGE,1,2010-12-01 14:32:00,569.77,<NA>,United Kingdom
3041,536592,DOT,DOTCOM POSTAGE,1,2010-12-01 17:06:00,607.49,<NA>,United Kingdom
5450,536862,DOT,DOTCOM POSTAGE,1,2010-12-03 11:13:00,254.43,<NA>,United Kingdom
5545,536864,DOT,DOTCOM POSTAGE,1,2010-12-03 11:27:00,121.06,<NA>,United Kingdom
5685,536865,DOT,DOTCOM POSTAGE,1,2010-12-03 11:28:00,498.47,<NA>,United Kingdom
...,...,...,...,...,...,...,...,...
536834,581219,DOT,DOTCOM POSTAGE,1,2011-12-08 09:28:00,1008.96,<NA>,United Kingdom
537254,581238,DOT,DOTCOM POSTAGE,1,2011-12-08 10:53:00,1683.75,<NA>,United Kingdom
539368,581439,DOT,DOTCOM POSTAGE,1,2011-12-08 16:30:00,938.59,<NA>,United Kingdom
540908,581492,DOT,DOTCOM POSTAGE,1,2011-12-09 10:03:00,933.17,<NA>,United Kingdom
541540,581498,DOT,DOTCOM POSTAGE,1,2011-12-09 10:26:00,1714.17,<NA>,United Kingdom

## Resumen 
1. Existen demasiados datos de 'Descripcion' por lo que diferencias cual es servicio y productos puede ser muy dificil porque tendriamos que hacer esa clasificiacion individualmente. (No veo necesario excluirlo porque a final fue una venta para la empresa)
2. Existe Invoices que se repiten para varios productos, por lo que se podria determinar que cada invoices le pertenece al mismo CustomerID.
3. Existen 10.624 datos con cantidades negativo. Si usamos estos el InvoiceNo para rellenar el CustomerID, no vamos a poder determinar cual compra fue una devolucion o una compra efectiva, dado que cada invoiceNo es diferente. 
4. Se podria crear una nueva columna donde se agrupen los valores cuya descripcion y valor coincida, quitando el negativo, solo para ver los que son devolucion antes de rellenar los valores de CustomerID

In [17]:
df_nulls.info()

<class 'pandas.core.frame.DataFrame'>
Index: 135080 entries, 622 to 541540
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    135080 non-null  object
 1   StockCode    135080 non-null  object
 2   Description  133626 non-null  object
 3   Quantity     135080 non-null  int64
 4   InvoiceDate  135080 non-null  datetime64[ns]
 5   UnitPrice    135080 non-null  float64
 6   CustomerID   0 non-null       Int64
 7   Country      135080 non-null  object
dtypes: Int64(1), datetime64[ns](1), float64(1), int64(1), object(4)
memory usage: 9.4+ MB

In [18]:
# Agrupar los datos por la columna 'InvoiceNo' y contar valores unicos
df_grouped = df.groupby('InvoiceNo').nunique().info()

<class 'pandas.core.frame.DataFrame'>
Index: 25900 entries, 536365 to C581569
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   StockCode    25900 non-null  int64
 1   Description  25900 non-null  int64
 2   Quantity     25900 non-null  int64
 3   InvoiceDate  25900 non-null  int64
 4   UnitPrice    25900 non-null  int64
 5   CustomerID   25900 non-null  int64
 6   Country      25900 non-null  int64
dtypes: int64(7)
memory usage: 1.6+ MB

In [19]:
# crea un nuevo df con las columnas 'InvoiceNo' y 'CustomerID'
df_invoice_customer = df[['InvoiceNo', 'CustomerID']]

In [20]:
df_invoice_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 2 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   InvoiceNo   541909 non-null  object
 1   CustomerID  406829 non-null  Int64
dtypes: Int64(1), object(1)
memory usage: 8.8+ MB

In [21]:
df_invoice_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 2 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   InvoiceNo   541909 non-null  object
 1   CustomerID  406829 non-null  Int64
dtypes: Int64(1), object(1)
memory usage: 8.8+ MB

In [22]:
# crea un df con las columnas 'InvoiceNo', 'CustomerID', Quantyty y UnitPrice
df_invoice_details = df[['InvoiceNo', 'CustomerID', 'Quantity', 'UnitPrice']]

In [23]:
# Agrega una nueva columna 'TotalPrice' que sea el resultado de multiplicar 'Quantity' por 'UnitPrice'
df_invoice_details['TotalPrice'] = df_invoice_details['Quantity'] * df_invoice_details['UnitPrice']

/var/folders/kw/4wrh588x7g5_4x1y7pjyp2c40000gn/T/ipykernel_63580/1990704250.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_invoice_details['TotalPrice'] = df_invoice_details['Quantity'] * df_invoice_details['UnitPrice']

In [24]:
df_invoice_details.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 5 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   InvoiceNo   541909 non-null  object
 1   CustomerID  406829 non-null  Int64
 2   Quantity    541909 non-null  int64
 3   UnitPrice   541909 non-null  float64
 4   TotalPrice  541909 non-null  float64
dtypes: Int64(1), float64(2), int64(1), object(1)
memory usage: 21.2+ MB

In [25]:
df['CustomerID'] = df.groupby('InvoiceNo')['CustomerID'].transform(lambda x: x.fillna(method='ffill').fillna(method='bfill'))

/var/folders/kw/4wrh588x7g5_4x1y7pjyp2c40000gn/T/ipykernel_63580/482626065.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['CustomerID'] = df.groupby('InvoiceNo')['CustomerID'].transform(lambda x: x.fillna(method='ffill').fillna(method='bfill'))

In [26]:
missing_count = df['CustomerID'].isnull().sum()
print(f"Datos faltantes restantes: {missing_count}")

Datos faltantes restantes: 135080

In [27]:
df['CustomerID'] = df.groupby('InvoiceNo')['CustomerID'].transform(lambda x: x.ffill().bfill())

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  datetime64[ns]
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  Int64
 7   Country      541909 non-null  object
dtypes: Int64(1), datetime64[ns](1), float64(1), int64(1), object(4)
memory usage: 33.6+ MB

In [29]:
# Cuantos valores de descuento hay en la columna descripcion de df
df['Description'].str.contains('discount', case=False, na=False).sum()

np.int64(77)

In [30]:
# Agregar una columna en df que indique el total price multiplicando el valor en 'Quantity' por 'UnitPrice'
df['TotalPrice'] = df['Quantity'] * df['UnitPrice']

In [31]:
# Suma el total price de las los datos que contienen discount en la columna 'Description'
total_discount_price = df[df['Description'].str.contains('discount', case=False, na=False)]['TotalPrice'].sum()
print(f"El total de precios con descuento es: {total_discount_price}")

El total de precios con descuento es: -5696.219999999999

In [32]:
# Eliminar todas las filas que contienen 'discount' en la columna 'Description'
df_no_discount = df[~df['Description'].str.contains('discount', case=False, na=False)]
# Guardar el DataFrame sin descuentos en un nuevo archivo CSV
df_no_discount.to_csv('online_retail_no_discount.csv', index=False)

In [33]:
pd.read_csv('online_retail_no_discount.csv').info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541832 entries, 0 to 541831
Data columns (total 9 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541832 non-null  object
 1   StockCode    541832 non-null  object
 2   Description  540378 non-null  object
 3   Quantity     541832 non-null  int64
 4   InvoiceDate  541832 non-null  object
 5   UnitPrice    541832 non-null  float64
 6   CustomerID   406752 non-null  float64
 7   Country      541832 non-null  object
 8   TotalPrice   541832 non-null  float64
dtypes: float64(3), int64(1), object(5)
memory usage: 37.2+ MB

In [34]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,TotalPrice
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 9 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  datetime64[ns]
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  Int64
 7   Country      541909 non-null  object
 8   TotalPrice   541909 non-null  float64
dtypes: Int64(1), datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 37.7+ MB

In [36]:
df['CustomerID'].isnull().sum()

np.int64(135080)

In [37]:
# Muestrame un df que contenga las columnas en las que el valor de 'CustomerId' y 'InvoiceNo' no son nulos
df_filtered = df[df['CustomerID'].notnull() & df['InvoiceNo'].notnull()][['CustomerID', 'InvoiceNo']]
df_filtered.info()

<class 'pandas.core.frame.DataFrame'>
Index: 406829 entries, 0 to 541908
Data columns (total 2 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   CustomerID  406829 non-null  Int64
 1   InvoiceNo   406829 non-null  object
dtypes: Int64(1), object(1)
memory usage: 9.7+ MB

In [38]:
df_nulls.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
622,536414,22139,NaN,56,2010-12-01 11:52:00,0.00,<NA>,United Kingdom
1443,536544,21773,DECORATIVE ROSE BATHROOM BOTTLE,1,2010-12-01 14:32:00,2.51,<NA>,United Kingdom
1444,536544,21774,DECORATIVE CATS BATHROOM BOTTLE,2,2010-12-01 14:32:00,2.51,<NA>,United Kingdom
1445,536544,21786,POLKADOT RAIN HAT,4,2010-12-01 14:32:00,0.85,<NA>,United Kingdom
1446,536544,21787,RAIN PONCHO RETROSPOT,2,2010-12-01 14:32:00,1.66,<NA>,United Kingdom

In [39]:
# Agregar columna de 'TotalPrice' al df_nulls
df_nulls['TotalPrice'] = df_nulls['Quantity'] * df_nulls['UnitPrice']

/var/folders/kw/4wrh588x7g5_4x1y7pjyp2c40000gn/T/ipykernel_63580/899599686.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_nulls['TotalPrice'] = df_nulls['Quantity'] * df_nulls['UnitPrice']

In [40]:
df_nulls.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,TotalPrice
622,536414,22139,NaN,56,2010-12-01 11:52:00,0.00,<NA>,United Kingdom,0.00
1443,536544,21773,DECORATIVE ROSE BATHROOM BOTTLE,1,2010-12-01 14:32:00,2.51,<NA>,United Kingdom,2.51
1444,536544,21774,DECORATIVE CATS BATHROOM BOTTLE,2,2010-12-01 14:32:00,2.51,<NA>,United Kingdom,5.02
1445,536544,21786,POLKADOT RAIN HAT,4,2010-12-01 14:32:00,0.85,<NA>,United Kingdom,3.40
1446,536544,21787,RAIN PONCHO RETROSPOT,2,2010-12-01 14:32:00,1.66,<NA>,United Kingdom,3.32

In [41]:
# Elimina las filas donde 'total price' sea igual o menos a 0
df_nulls = df_nulls[df_nulls['TotalPrice'] > 0]

In [42]:
# Rellena los valores nulos de 'CustomerID' en df_nulls con el valor de 'InvoiceNo' + 'A' al inicio
df_nulls['CustomerID'] = df_nulls['InvoiceNo'].astype(str) + 'A'

In [43]:
df_nulls.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,TotalPrice
1443,536544,21773,DECORATIVE ROSE BATHROOM BOTTLE,1,2010-12-01 14:32:00,2.51,536544A,United Kingdom,2.51
1444,536544,21774,DECORATIVE CATS BATHROOM BOTTLE,2,2010-12-01 14:32:00,2.51,536544A,United Kingdom,5.02
1445,536544,21786,POLKADOT RAIN HAT,4,2010-12-01 14:32:00,0.85,536544A,United Kingdom,3.40
1446,536544,21787,RAIN PONCHO RETROSPOT,2,2010-12-01 14:32:00,1.66,536544A,United Kingdom,3.32
1447,536544,21790,VINTAGE SNAP CARDS,9,2010-12-01 14:32:00,1.66,536544A,United Kingdom,14.94

In [44]:
# Cuenta el valor de 'TotalPrice' por cada 'CustomerID' en df_nulls
df_nulls.groupby('CustomerID')['TotalPrice'].sum().reset_index()

     CustomerID  TotalPrice
0       536544A     5521.14
1       536555A        2.97
2       536558A       99.75
3       536565A        6.70
4       536592A     6915.65
...         ...         ...
1423    581439A     6637.59
1424    581492A     7689.23
1425    581497A     3217.20
1426    581498A     5664.89
1427   A563185A    11062.06

[1428 rows x 2 columns]

In [ ]:
#Completas los

In [45]:
# Une df_nulls con df sustituyendo los valores nulos de 'CustomerID' por los nuevos valores
df = df.merge(df_nulls[['InvoiceNo', 'CustomerID']], on='InvoiceNo', how='left')

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39554076 entries, 0 to 39554075
Data columns (total 10 columns):
 #   Column        Dtype
---  ------        -----
 0   InvoiceNo     object
 1   StockCode     object
 2   Description   object
 3   Quantity      int64
 4   InvoiceDate   datetime64[ns]
 5   UnitPrice     float64
 6   CustomerID_x  Int64
 7   Country       object
 8   TotalPrice    float64
 9   CustomerID_y  object
dtypes: Int64(1), datetime64[ns](1), float64(2), int64(1), object(5)
memory usage: 3.0+ GB